cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'cmake'
brew 'coreutils'
brew 'elixir'
brew 'eqnxio/ngrok/ngrok'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'go'
brew 'gpg-agent'
brew 'grc'
brew 'heroku'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'libyaml'
brew 'memcached'
brew 'mongodb'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'readline'
brew 'redis'
brew 'ruby-build'
brew 'spark'
brew 'the_silver_searcher'
brew 'unrar'
brew 'wget'
brew 'yarn'

cask '1password'
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'gasmask'
cask 'github-desktop'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'licecap'
cask 'messenger'
cask 'postgres'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'telegram'
cask 'tunnelbear'
cask 'utorrent'
cask 'vlc'
